#language: ru
Функционал: OZON

  @all
  Сценарий: Первый сценарий

    * Вбиваем в "поисковую строку" товар "iphone"

    * Жмем "кнопку поиска"

    * Устанавливаем "максимальную цену" в "100000"

    * В блоке '"Беспроводные технологии"' выбираем '"NFC"'

    * Выбираем '"Высокий рейтинг"'

    * Выбираем 8 товаров. % 2 == 1

    * Переходим в "корзину"

    * Сохраняем название и цену товара

    * Проверяем наличие товаров в корзине

    * Проверяем наличие надписи '"Ваша корзина"'
    * Проверяем наличие надписи '"8 товаров"'

    * "Очищаем корзину"
    * "Точно-преточно очищаем корзину"

    * Проверяем отсутствие товаров в корзине

    * Наименование товаров и их цены


  @all
  Сценарий: Второй сценарий

    * Вбиваем в "поисковую строку" товар "беспроводные наушники"

    * Жмем "кнопку поиска"

    * Устанавливаем "максимальную цену" в "10000"

    * Жмем на '"Просмотреть все"'

    * В блоке '"Бренды"' находим и выбираем '"Xiaomi"'
#    * В блоке '"Бренды"' находим и выбираем '"Beats"'
    * В блоке '"Бренды"' находим и выбираем '"Samsung"'

    * Выбираем '"Высокий рейтинг"'

    * Выбираем 8 товаров. % 2 == 0

    * Переходим в "корзину"

    * Сохраняем название и цену товара

    * Проверяем наличие товаров в корзине

    * Проверяем наличие надписи '"Ваша корзина"'
    * Проверяем наличие надписи '"8 товаров"'

    * "Очищаем корзину"
    * "Точно-преточно очищаем корзину"

    * Проверяем отсутствие товаров в корзине

    * Наименование товаров и их цены
